burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_evic.h
/*!
    \file    gd32m53x_evic.h
    \brief   definitions for the EVIC

    \version 2026-03-04, V1.0.0, firmware for GD32M53x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32M53X_EVIC_H
#define GD32M53X_EVIC_H

#include "gd32m53x.h"

/* EVIC definitions */
#define EVIC                              EVIC_BASE                         /*!< EVIC base address */

/* register definitions */
#define EVIC_SWEV                         REG32((EVIC) + 0x00000000U)       /*!< EVIC software event register */
#define EVIC_SGIO0                        REG32((EVIC) + 0x00000004U)       /*!< EVIC event interconnect for single I/O register 0 */
#define EVIC_SGIO1                        REG32((EVIC) + 0x00000008U)       /*!< EVIC event interconnect for single I/O register 1 */
#define EVIC_SGIO2                        REG32((EVIC) + 0x0000000CU)       /*!< EVIC event interconnect for single I/O register 2 */
#define EVIC_SGIO3                        REG32((EVIC) + 0x00000010U)       /*!< EVIC event interconnect for single I/O register 3 */
#define EVIC_INGRPE                       REG32((EVIC) + 0x00000014U)       /*!< EVIC event interconnect for input group E register */
#define EVIC_INGRPF                       REG32((EVIC) + 0x00000018U)       /*!< EVIC event interconnect for input group F register */
#define EVIC_OUTGRPE                      REG32((EVIC) + 0x0000001CU)       /*!< EVIC event interconnect for output group E register */
#define EVIC_OUTGRPF                      REG32((EVIC) + 0x00000020U)       /*!< EVIC event interconnect for output group F register */
#define EVIC_DAC0COV                      REG32((EVIC) + 0x00000024U)       /*!< EVIC event interconnect for DAC0 conversion register */
#define EVIC_ADC0COV                      REG32((EVIC) + 0x00000028U)       /*!< EVIC event interconnect for ADC0 conversion register */
#define EVIC_ADC2COV                      REG32((EVIC) + 0x0000002CU)       /*!< EVIC event interconnect for ADC2 conversion register */
#define EVIC_RCU                          REG32((EVIC) + 0x00000034U)       /*!< EVIC event interconnect for RCU register */
#define EVIC_TIMER0                       REG32((EVIC) + 0x00000038U)       /*!< EVIC event interconnect for TIMER0 register */
#define EVIC_TIMER7                       REG32((EVIC) + 0x0000003CU)       /*!< EVIC event interconnect for TIMER7 register */
#define EVIC_CPTIMER0                     REG32((EVIC) + 0x00000040U)       /*!< EVIC event interconnect for CPTIMER0 register */
#define EVIC_CPTIMERW                     REG32((EVIC) + 0x00000044U)       /*!< EVIC event interconnect for CPTIMERW register */
#define EVIC_TIMER1                       REG32((EVIC) + 0x00000048U)       /*!< EVIC event interconnect for TIMER1 register */
#define EVIC_TIMER2                       REG32((EVIC) + 0x0000004CU)       /*!< EVIC event interconnect for TIMER2 register */
#define EVIC_GPTIMER_0                    REG32((EVIC) + 0x00000050U)       /*!< EVIC event interconnect for GPTIMER register 0 */
#define EVIC_GPTIMER_1                    REG32((EVIC) + 0x00000054U)       /*!< EVIC event interconnect for GPTIMER register 1 */
#define EVIC_GPTIMER_2                    REG32((EVIC) + 0x00000058U)       /*!< EVIC event interconnect for GPTIMER register 2 */
#define EVIC_GPTIMER_3                    REG32((EVIC) + 0x0000005CU)       /*!< EVIC event interconnect for GPTIMER register 3 */
#define EVIC_DAC0EN                       REG32((EVIC) + 0x00000060U)       /*!< EVIC event interconnect for DAC0 enable register */
#define EVIC_DMAMUX_0                     REG32((EVIC) + 0x00000064U)       /*!< EVIC event interconnect for DMAMUX register 0 */
#define EVIC_DMAMUX_1                     REG32((EVIC) + 0x00000068U)       /*!< EVIC event interconnect for DMAMUX register 1 */
#define EVIC_DMAMUX_2                     REG32((EVIC) + 0x0000006CU)       /*!< EVIC event interconnect for DMAMUX register 2 */
#define EVIC_DMAMUX_3                     REG32((EVIC) + 0x00000070U)       /*!< EVIC event interconnect for DMAMUX register 3 */
#define EVIC_DMAMUX_4                     REG32((EVIC) + 0x00000074U)       /*!< EVIC event interconnect for DMAMUX register 4 */
#define EVIC_DMAMUX_5                     REG32((EVIC) + 0x00000078U)       /*!< EVIC event interconnect for DMAMUX register 5 */
#define EVIC_SMCFG0                       REG32((EVIC) + 0x0000007CU)       /*!< EVIC slave mode configuration register 0 */
#define EVIC_SMCFG1                       REG32((EVIC) + 0x00000080U)       /*!< EVIC slave mode configuration register 1 */
#define EVIC_SGIOCFG0                     REG32((EVIC) + 0x00000084U)       /*!< EVIC single I/O configuration register 0 */
#define EVIC_SGIOCFG1                     REG32((EVIC) + 0x00000088U)       /*!< EVIC single I/O configuration register 1 */
#define EVIC_SGIOCFG2                     REG32((EVIC) + 0x0000008CU)       /*!< EVIC single I/O configuration register 2 */
#define EVIC_SGIOCFG3                     REG32((EVIC) + 0x00000090U)       /*!< EVIC single I/O configuration register 3 */
#define EVIC_GRPECFG                      REG32((EVIC) + 0x00000094U)       /*!< EVIC group E configuration register */
#define EVIC_GRPEDH                       REG32((EVIC) + 0x00000098U)       /*!< EVIC group E data holding register */
#define EVIC_GRPFCFG                      REG32((EVIC) + 0x0000009CU)       /*!< EVIC group F configuration register */
#define EVIC_GRPFDH                       REG32((EVIC) + 0x00000100U)       /*!< EVIC group F data holding register */

/* bit definitions */
/* EVIC_SWEV */
#define EVIC_SWTR_BWEN                    BIT(0)                            /*!< SWEVG bit trigger enable */
#define EVIC_SWTR_SWEVG                   BIT(1)                            /*!< Software trigger generation */
#define EVIC_SWTR_RWEN                    BIT(31)                           /*!< Software event register write disable */

/* Event interconnect register */
#define EVIC_TARGET_EVSEL0                BITS(0,7)                         /*!< Event source selection 0 */
#define EVIC_TARGET_EVSEL1                BITS(8,15)                        /*!< Event source selection 1 */
#define EVIC_TARGET_EVSEL2                BITS(16,23)                       /*!< Event source selection 2 */
#define EVIC_TARGET_LK                    BIT(31)                           /*!< EVIC register lock */

