burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_evic.h
/* EVIC_SMCFG0 */
#define EVIC_SMCFG0_CPTIMER0_SMSEL       BITS(0,1)                          /*!< CPTIMER0 slave mode selection */

/* EVIC_SMCFG1 */
#define EVIC_SMCFG1_CPTIMERW_SMSEL        BITS(0,1)                         /*!< CPTIMERW slave mode selection */

/* EVIC_SGIOCFGx (x=0,1,2,3) */
#define EVIC_SGIOCFGX_SGIOPORT            BITS(0,1)                         /*!< Single I/O port selection */
#define EVIC_SGIOCFGX_SGIOPIN             BITS(2,4)                         /*!< Single I/O pin selection */
#define EVIC_SGIOCFGX_SGIOM               BITS(5,6)                         /*!< Single I/O mode selection */

/* EVIC_GRPECFG */
#define EVIC_GRPECFG_GRPEIND              BITS(0,1)                         /*!< Group E input detection */
#define EVIC_GRPECFG_GRPEOSEL             BITS(2,4)                         /*!< Group E output selection */
#define EVIC_GRPECFG_OVWEN                BIT(5)                            /*!< EVIC_GRPEDH register overwrite enable */
#define EVIC_GRPECFG_PE8SEL               BIT(8)                            /*!< PE8 pin selection */
#define EVIC_GRPECFG_PE9SEL               BIT(9)                            /*!< PE9 pin selection */
#define EVIC_GRPECFG_PE10SEL              BIT(10)                           /*!< PE10 pin selection */
#define EVIC_GRPECFG_PE11SEL              BIT(11)                           /*!< PE11 pin selection */
#define EVIC_GRPECFG_PE12SEL              BIT(12)                           /*!< PE12 pin selection */
#define EVIC_GRPECFG_PE13SEL              BIT(13)                           /*!< PE13 pin selection */
#define EVIC_GRPECFG_PE14SEL              BIT(14)                           /*!< PE14 pin selection */

/* EVIC_GRPEDH */
#define EVIC_GRPE_DH                      BITS(0,6)                         /*!< Group E holding data */

/* EVIC_GRPFCFG */
#define EVIC_GRPFCFG_GRPFIND              EVIC_GRPECFG_GRPEIND              /*!< Group F input detection */
#define EVIC_GRPFCFG_GRPFOSEL             EVIC_GRPECFG_GRPEOSEL             /*!< Group F output selection */
#define EVIC_GRPFCFG_OVWEN                EVIC_GRPECFG_OVWEN                /*!< EVIC_GRPFDH register overwrite enable */
#define EVIC_GRPFCFG_PF8SEL               EVIC_GRPECFG_PE8SEL               /*!< PF8 pin selection */
#define EVIC_GRPFCFG_PF9SEL               EVIC_GRPECFG_PE9SEL               /*!< PF9 pin selection */
#define EVIC_GRPFCFG_PF10SEL              EVIC_GRPECFG_PE10SEL              /*!< PF10 pin selection */
#define EVIC_GRPFCFG_PF11SEL              EVIC_GRPECFG_PE11SEL              /*!< PF11 pin selection */
#define EVIC_GRPFCFG_PF12SEL              EVIC_GRPECFG_PE12SEL              /*!< PF12 pin selection */
#define EVIC_GRPFCFG_PF13SEL              EVIC_GRPECFG_PE13SEL              /*!< PF13 pin selection */
#define EVIC_GRPFCFG_PF14SEL              EVIC_GRPECFG_PE14SEL              /*!< PF14 pin selection */

/* EVIC_GRPFDH */
#define EVIC_GRPF_DH                      EVIC_GRPE_DH                      /*!< Group F holding data */

/* constants definitions */
/* Event source definitions */
typedef enum {
    EVIC_SOURCE_DISABLED                                 = ((uint8_t)0x00U),                /*!< Event signal output is disabled */
    EVIC_SOURCE_SOFTWARE                                 = ((uint8_t)0x01U),                /*!< Software generation event */
    EVIC_SOURCE_SGIO_INPUT_DETECTION0                    = ((uint8_t)0x02U),                /*!< Single I/O input detection 0 */
    EVIC_SOURCE_SGIO_INPUT_DETECTION1                    = ((uint8_t)0x03U),                /*!< Single I/O input detection 1 */
    EVIC_SOURCE_SGIO_INPUT_DETECTION2                    = ((uint8_t)0x04U),                /*!< Single I/O input detection 2 */
    EVIC_SOURCE_SGIO_INPUT_DETECTION3                    = ((uint8_t)0x05U),                /*!< Single I/O input detection 3 */
    EVIC_SOURCE_GRPE_INPUT_DETECTION                     = ((uint8_t)0x06U),                /*!< Group E I/O input detection */
    EVIC_SOURCE_GRPF_INPUT_DETECTION                     = ((uint8_t)0x07U),                /*!< Group F I/O input detection */
    EVIC_SOURCE_TIMER0_OVERFLOW                          = ((uint8_t)0x08U),                /*!< TIMER0 overflow event */
    EVIC_SOURCE_TIMER0_UNDERFLOW                         = ((uint8_t)0x09U),                /*!< TIMER0 underflow event */
    EVIC_SOURCE_TIMER0_CH0_COMPARE                       = ((uint8_t)0x0AU),                /*!< TIMER0_CH0 compare event */
    EVIC_SOURCE_TIMER0_CH1_COMPARE                       = ((uint8_t)0x0BU),                /*!< TIMER0_CH1 compare event */
    EVIC_SOURCE_TIMER0_CH2_COMPARE                       = ((uint8_t)0x0CU),                /*!< TIMER0_CH2 compare event */
    EVIC_SOURCE_TIMER0_CH3_COMPARE                       = ((uint8_t)0x0DU),                /*!< TIMER0_CH3 compare event */
    EVIC_SOURCE_TIMER0_MCH0_COMPARE                      = ((uint8_t)0x0EU),                /*!< TIMER0_MCH0 compare event */
    EVIC_SOURCE_TIMER0_MCH1_COMPARE                      = ((uint8_t)0x0FU),                /*!< TIMER0_MCH1 compare event */
    EVIC_SOURCE_TIMER0_MCH2_COMPARE                      = ((uint8_t)0x10U),                /*!< TIMER0_MCH2 compare event */
    EVIC_SOURCE_TIMER0_MCH3_COMPARE                      = ((uint8_t)0x11U),                /*!< TIMER0_MCH3 compare event */
    EVIC_SOURCE_TIMER0_TRGO                              = ((uint8_t)0x12U),                /*!< TIMER0 TRGO signal */
    EVIC_SOURCE_TIMER7_OVERFLOW                          = ((uint8_t)0x13U),                /*!< TIMER7 overflow event */
    EVIC_SOURCE_TIMER7_UNDERFLOW                         = ((uint8_t)0x14U),                /*!< TIMER7 underflow event */
    EVIC_SOURCE_TIMER7_CH0_COMPARE                       = ((uint8_t)0x15U),                /*!< TIMER7_CH0 compare event */
    EVIC_SOURCE_TIMER7_CH1_COMPARE                       = ((uint8_t)0x16U),                /*!< TIMER7_CH1 compare event */
    EVIC_SOURCE_TIMER7_CH2_COMPARE                       = ((uint8_t)0x17U),                /*!< TIMER7_CH2 compare event */
    EVIC_SOURCE_TIMER7_CH3_COMPARE                       = ((uint8_t)0x18U),                /*!< TIMER7_CH3 compare event */
    EVIC_SOURCE_TIMER7_MCH0_COMPARE                      = ((uint8_t)0x19U),                /*!< TIMER7_MCH0 compare event */
    EVIC_SOURCE_TIMER7_MCH1_COMPARE                      = ((uint8_t)0x1AU),                /*!< TIMER7_MCH1 compare event */
    EVIC_SOURCE_TIMER7_MCH2_COMPARE                      = ((uint8_t)0x1BU),                /*!< TIMER7_MCH2 compare event */
    EVIC_SOURCE_TIMER7_MCH3_COMPARE                      = ((uint8_t)0x1CU),                /*!< TIMER7_MCH3 compare event */
    EVIC_SOURCE_TIMER7_TRGO                              = ((uint8_t)0x1DU),                /*!< TIMER7 TRGO signal */
    EVIC_SOURCE_TIMER1_CH0_COMPARE                       = ((uint8_t)0x1EU),                /*!< TIMER1_CH0 compare event */
    EVIC_SOURCE_TIMER1_CH1_COMPARE                       = ((uint8_t)0x1FU),                /*!< TIMER1_CH1 compare event */
    EVIC_SOURCE_TIMER1_CH2_COMPARE                       = ((uint8_t)0x20U),                /*!< TIMER1_CH2 compare event */
    EVIC_SOURCE_TIMER1_CH3_COMPARE                       = ((uint8_t)0x21U),                /*!< TIMER1_CH3 compare event */
    EVIC_SOURCE_TIMER1_OVERFLOW                          = ((uint8_t)0x22U),                /*!< TIMER1 overflow event */
    EVIC_SOURCE_TIMER1_UNDERFLOW                         = ((uint8_t)0x23U),                /*!< TIMER1 underflow event */
    EVIC_SOURCE_TIMER1_TRGO                              = ((uint8_t)0x24U),                /*!< TIMER1 TRGO signal */
    EVIC_SOURCE_TIMER2_CH0_COMPARE                       = ((uint8_t)0x25U),                /*!< TIMER2_CH0 compare event */
    EVIC_SOURCE_TIMER2_CH1_COMPARE                       = ((uint8_t)0x26U),                /*!< TIMER2_CH1 compare event */
    EVIC_SOURCE_TIMER2_CH2_COMPARE                       = ((uint8_t)0x27U),                /*!< TIMER2_CH2 compare event */
    EVIC_SOURCE_TIMER2_CH3_COMPARE                       = ((uint8_t)0x28U),                /*!< TIMER2_CH3 compare event */
    EVIC_SOURCE_TIMER2_OVERFLOW                          = ((uint8_t)0x29U),                /*!< TIMER2 overflow event */
    EVIC_SOURCE_TIMER2_UNDERFLOW                         = ((uint8_t)0x2AU),                /*!< TIMER2 underflow event */
    EVIC_SOURCE_TIMER2_TRGO                              = ((uint8_t)0x2BU),                /*!< TIMER2 TRGO signal */
    EVIC_SOURCE_CPTIMER0_COUNTER0_OVERFLOW               = ((uint8_t)0x2CU),                /*!< CPTIMER0 counter 0 overflow event */
    EVIC_SOURCE_CPTIMERW_OCH2_COMPARE_MATCH              = ((uint8_t)0x2EU),                /*!< CPTIMERW_OCH2 compare match event */
    EVIC_SOURCE_CPTIMERW_OCH3_COMPARE_MATCH              = ((uint8_t)0x2FU),                /*!< CPTIMERW_OCH3 compare match event */
    EVIC_SOURCE_CPTIMERW_OCH0_COMPARE_MATCH              = ((uint8_t)0x30U),                /*!< CPTIMERW_OCH0 compare match event */
    EVIC_SOURCE_CPTIMERW_OCH1_COMPARE_MATCH              = ((uint8_t)0x31U),                /*!< CPTIMERW_OCH1 compare match event */
    EVIC_SOURCE_GPTIMER0_CH0_COMPARE_MATCH               = ((uint8_t)0x35U),                /*!< GPTIMER0_CH0 compare match event */
    EVIC_SOURCE_GPTIMER0_CH1_COMPARE_MATCH               = ((uint8_t)0x36U),                /*!< GPTIMER0_CH1 compare match event */
    EVIC_SOURCE_GPTIMER0_CH0_ADD_COMPARE_MATCH           = ((uint8_t)0x37U),                /*!< GPTIMER0_CH0 addition compare match event */
    EVIC_SOURCE_GPTIMER0_CH1_ADD_COMPARE_MATCH           = ((uint8_t)0x38U),                /*!< GPTIMER0_CH1 addition compare match event */
    EVIC_SOURCE_GPTIMER0_OVERFLOW                        = ((uint8_t)0x39U),                /*!< GPTIMER0 overflow event */
    EVIC_SOURCE_GPTIMER0_UNDERFLOW                       = ((uint8_t)0x3AU),                /*!< GPTIMER0 underflow event */
    EVIC_SOURCE_GPTIMER0_ADTCV1_MATCH                    = ((uint8_t)0x3BU),                /*!< GPTIMER0 ADTCV1 match event */
    EVIC_SOURCE_GPTIMER0_ADTCV2_MATCH                    = ((uint8_t)0x3CU),                /*!< GPTIMER0 ADTCV2 match event */
    EVIC_SOURCE_GPTIMER0_REPEAT_COUNT_END                = ((uint8_t)0x3DU),                /*!< GPTIMER0 end of repeat count event */
    EVIC_SOURCE_CMP0_OUT                                 = ((uint8_t)0x40U),                /*!< CMP0 output signal */
    EVIC_SOURCE_CMP1_OUT                                 = ((uint8_t)0x41U),                /*!< CMP1 output signal */
    EVIC_SOURCE_CMP2_OUT                                 = ((uint8_t)0x42U),                /*!< CMP2 output signal */
    EVIC_SOURCE_CMP3_OUT                                 = ((uint8_t)0x43U),                /*!< CMP3 output signal */
    EVIC_SOURCE_ADC0_GRP_SCAN_COMPLETE                   = ((uint8_t)0x44U),                /*!< ADC0 group scan complete event */
    EVIC_SOURCE_ADC2_GRP_SCAN_COMPLETE                   = ((uint8_t)0x45U),                /*!< ADC2 group scan complete event */
    EVIC_SOURCE_LVD1_VOLTAGE_DETECTION                   = ((uint8_t)0x46U),                /*!< LVD1 voltage detection */
    EVIC_SOURCE_LVD2_VOLTAGE_DETECTION                   = ((uint8_t)0x47U),                /*!< LVD2 voltage detection */
    EVIC_SOURCE_FWDGT_UNDERFLOW_OR_REFRESH               = ((uint8_t)0x48U),                /*!< FWDGT underflow or refresh */
    EVIC_SOURCE_HXTAL_STUCK                              = ((uint8_t)0x49U),                /*!< HXTAL stuck event */
    EVIC_SOURCE_DMA0_CH0_TRANSFER_FINISH                 = ((uint8_t)0x4AU),                /*!< DMA0 channel 0 full transfer finish event */
    EVIC_SOURCE_DMA0_CH1_TRANSFER_FINISH                 = ((uint8_t)0x4BU),                /*!< DMA0 channel 1 full transfer finish event */
    EVIC_SOURCE_DMA0_CH2_TRANSFER_FINISH                 = ((uint8_t)0x4CU),                /*!< DMA0 channel 2 full transfer finish event */
    EVIC_SOURCE_DMA0_CH3_TRANSFER_FINISH                 = ((uint8_t)0x4DU),                /*!< DMA0 channel 3 full transfer finish event */
    EVIC_SOURCE_DMA0_CH4_TRANSFER_FINISH                 = ((uint8_t)0x4EU),                /*!< DMA0 channel 4 full transfer finish event */
    EVIC_SOURCE_DMA0_CH5_TRANSFER_FINISH                 = ((uint8_t)0x4FU),                /*!< DMA0 channel 5 full transfer finish event */
    EVIC_SOURCE_DMA1_CH0_TRANSFER_FINISH                 = ((uint8_t)0x50U),                /*!< DMA1 channel 0 full transfer finish event */
    EVIC_SOURCE_DMA1_CH1_TRANSFER_FINISH                 = ((uint8_t)0x51U),                /*!< DMA1 channel 1 full transfer finish event */
    EVIC_SOURCE_DMA1_CH2_TRANSFER_FINISH                 = ((uint8_t)0x52U),                /*!< DMA1 channel 2 full transfer finish event */
    EVIC_SOURCE_DMA1_CH3_TRANSFER_FINISH                 = ((uint8_t)0x53U),                /*!< DMA1 channel 3 full transfer finish event */
    EVIC_SOURCE_DMA1_CH4_TRANSFER_FINISH                 = ((uint8_t)0x54U),                /*!< DMA1 channel 4 full transfer finish event */
    EVIC_SOURCE_DMA1_CH5_TRANSFER_FINISH                 = ((uint8_t)0x55U),                /*!< DMA1 channel 5 full transfer finish event */
    EVIC_SOURCE_CAN_TRANSMIT_INT                         = ((uint8_t)0x56U),                /*!< CAN transmit interrupt event */
    EVIC_SOURCE_CAN_FIFO0_INT                            = ((uint8_t)0x57U),                /*!< CAN FIFO0 interrupt event */
    EVIC_SOURCE_CAN_FIFO1_INT                            = ((uint8_t)0x58U),                /*!< CAN FIFO1 interrupt event */
    EVIC_SOURCE_CAN_EWMC_INT                             = ((uint8_t)0x59U),                /*!< CAN EWMC interrupt event */
    EVIC_SOURCE_UART0_ERROR                              = ((uint8_t)0x5CU),                /*!< UART0 error (PERR /FERR /NERR /ORERR) */
    EVIC_SOURCE_UART0_TRANSMIT_COMPLETE                  = ((uint8_t)0x5DU),                /*!< UART0 transmission complete */
    EVIC_SOURCE_UART1_ERROR                              = ((uint8_t)0x5EU),                /*!< UART1 error (PERR /FERR /NERR /ORERR) */
    EVIC_SOURCE_UART1_TRANSMIT_COMPLETE                  = ((uint8_t)0x5FU),                /*!< UART1 transmission complete */
    EVIC_SOURCE_UART2_ERROR                              = ((uint8_t)0x60U),                /*!< UART2 error (PERR /FERR /NERR /ORERR) */
    EVIC_SOURCE_UART2_TRANSMIT_COMPLETE                  = ((uint8_t)0x61U),                /*!< UART2 transmission complete */
    EVIC_SOURCE_UART3_ERROR                              = ((uint8_t)0x62U),                /*!< UART3 error (PERR /FERR /NERR /ORERR) */
    EVIC_SOURCE_UART3_TRANSMIT_COMPLETE                  = ((uint8_t)0x63U),                /*!< UART3 transmission complete */
    EVIC_SOURCE_SPI_ERROR                                = ((uint8_t)0x67U),                /*!< SPI error */
    EVIC_SOURCE_SPI_COMMUNICATION_COMPLETE               = ((uint8_t)0x68U),                /*!< SPI transfer complete event */
    EVIC_SOURCE_I2C_COMMUNICATION_ERROR_OR_EVENT         = ((uint8_t)0x69U),                /*!< I2C communication error/communication event */
    EVIC_SOURCE_I2C_RECEIVE_DATA_NOT_EMPTY               = ((uint8_t)0x6AU),                /*!< I2C_RDATA is not empty during receiving */
    EVIC_SOURCE_I2C_TRANSMIT_INT                         = ((uint8_t)0x6BU),                /*!< I2C transmit interrupt event */
    EVIC_SOURCE_I2C_TRANSFER_COMPLETE                    = ((uint8_t)0x6CU),                /*!< I2C transfer complete event */
    EVIC_SOURCE_GPTIMER1_CH0_COMPARE_MATCH               = ((uint8_t)0x6DU),                /*!< GPTIMER1_CH0 compare match event */
    EVIC_SOURCE_GPTIMER1_CH1_COMPARE_MATCH               = ((uint8_t)0x6EU),                /*!< GPTIMER1_CH1 compare match event */
    EVIC_SOURCE_GPTIMER1_CH0_ADD_COMPARE_MATCH           = ((uint8_t)0x6FU),                /*!< GPTIMER1_CH0 addition compare match event */
    EVIC_SOURCE_GPTIMER1_CH1_ADD_COMPARE_MATCH           = ((uint8_t)0x70U),                /*!< GPTIMER1_CH1 addition compare match event */
    EVIC_SOURCE_GPTIMER1_OVERFLOW                        = ((uint8_t)0x71U),                /*!< GPTIMER1 overflow event */
    EVIC_SOURCE_GPTIMER1_UNDERFLOW                       = ((uint8_t)0x72U),                /*!< GPTIMER1 underflow event */
    EVIC_SOURCE_GPTIMER1_ADTCV1_MATCH                    = ((uint8_t)0x73U),                /*!< GPTIMER1 ADTCV1 match event */
    EVIC_SOURCE_GPTIMER1_ADTCV2_MATCH                    = ((uint8_t)0x74U),                /*!< GPTIMER1 ADTCV2 match event */
    EVIC_SOURCE_GPTIMER1_REPEAT_COUNT_END                = ((uint8_t)0x75U),                /*!< GPTIMER1 end of repeat count event */
} event_source_enum;

/* target peripheral definitions */
typedef enum {
    EVENT_INTERCONNECT_SGIO0                             = ((uint8_t)0x04U),                /*!< single I/O 0 */
    EVENT_INTERCONNECT_SGIO1                             = ((uint8_t)0x08U),                /*!< single I/O 1 */
    EVENT_INTERCONNECT_SGIO2                             = ((uint8_t)0x0CU),                /*!< single I/O 2 */
    EVENT_INTERCONNECT_SGIO3                             = ((uint8_t)0x10U),                /*!< single I/O 3 */
    EVENT_INTERCONNECT_INGRPE                            = ((uint8_t)0x14U),                /*!< input group E */
    EVENT_INTERCONNECT_INGRPF                            = ((uint8_t)0x18U),                /*!< input group F */
    EVENT_INTERCONNECT_OUTGRPE                           = ((uint8_t)0x1CU),                /*!< output group E */
    EVENT_INTERCONNECT_OUTGRPF                           = ((uint8_t)0x20U),                /*!< output group F */
    EVENT_INTERCONNECT_DAC0_OUT0_COV                     = ((uint8_t)0x24U),                /*!< DAC0_OUT0 conversion */
    EVENT_INTERCONNECT_DAC0_OUT1_COV                     = ((uint8_t)0x25U),                /*!< DAC0_OUT1 conversion */
    EVENT_INTERCONNECT_ADC0_GRP_EXTRIG0                  = ((uint8_t)0x28U),                /*!< ADC0 group external trigger 0 */
    EVENT_INTERCONNECT_ADC0_GRP_EXTRIG1                  = ((uint8_t)0x29U),                /*!< ADC0 group external trigger 1 */
    EVENT_INTERCONNECT_ADC2_GRP_EXTRIG0                  = ((uint8_t)0x2CU),                /*!< ADC2 group external trigger 0 */
    EVENT_INTERCONNECT_ADC2_GRP_EXTRIG1                  = ((uint8_t)0x2DU),                /*!< ADC2 group external trigger 1 */
    EVENT_INTERCONNECT_RCU                               = ((uint8_t)0x34U),                /*!< clock switch to IRC32M */
    EVENT_INTERCONNECT_TIMER0                            = ((uint8_t)0x38U),                /*!< TIMER0 */
    EVENT_INTERCONNECT_TIMER7                            = ((uint8_t)0x3CU),                /*!< TIMER7 */
    EVENT_INTERCONNECT_CPTIMER0                          = ((uint8_t)0x40U),                /*!< CPTIMER0 */
    EVENT_INTERCONNECT_CPTIMERW                          = ((uint8_t)0x44U),                /*!< CPTIMERW */
    EVENT_INTERCONNECT_TIMER1                            = ((uint8_t)0x48U),                /*!< TIMER1 */
    EVENT_INTERCONNECT_TIMER2                            = ((uint8_t)0x4CU),                /*!< TIMER2 */
    EVENT_INTERCONNECT_GPTIMER_TRIGIN0                   = ((uint8_t)0x50U),                /*!< GPTIMER trigger input 0 */
    EVENT_INTERCONNECT_GPTIMER_TRIGIN1                   = ((uint8_t)0x51U),                /*!< GPTIMER trigger input 1 */
    EVENT_INTERCONNECT_GPTIMER_TRIGIN2                   = ((uint8_t)0x54U),                /*!< GPTIMER trigger input 2 */
    EVENT_INTERCONNECT_GPTIMER_TRIGIN3                   = ((uint8_t)0x55U),                /*!< GPTIMER trigger input 3 */
    EVENT_INTERCONNECT_GPTIMER_TRIGIN4                   = ((uint8_t)0x58U),                /*!< GPTIMER trigger input 4 */
    EVENT_INTERCONNECT_GPTIMER_TRIGIN5                   = ((uint8_t)0x59U),                /*!< GPTIMER trigger input 5 */
    EVENT_INTERCONNECT_GPTIMER_TRIGIN6                   = ((uint8_t)0x5CU),                /*!< GPTIMER trigger input 6 */
    EVENT_INTERCONNECT_GPTIMER_TRIGIN7                   = ((uint8_t)0x5DU),                /*!< GPTIMER trigger input 7 */
    EVENT_INTERCONNECT_DAC0_OUT0_EN                      = ((uint8_t)0x60U),                /*!< DAC0_OUT0 enable */
    EVENT_INTERCONNECT_DAC0_OUT1_EN                      = ((uint8_t)0x61U),                /*!< DAC0_OUT1 enable */
    EVENT_INTERCONNECT_DMAMUX_0                          = ((uint8_t)0x64U),                /*!< DMAMUX multiplexer input 0 */
    EVENT_INTERCONNECT_DMAMUX_1                          = ((uint8_t)0x65U),                /*!< DMAMUX multiplexer input 1 */
    EVENT_INTERCONNECT_DMAMUX_2                          = ((uint8_t)0x68U),                /*!< DMAMUX multiplexer input 2 */
    EVENT_INTERCONNECT_DMAMUX_3                          = ((uint8_t)0x69U),                /*!< DMAMUX multiplexer input 3 */
    EVENT_INTERCONNECT_DMAMUX_4                          = ((uint8_t)0x6CU),                /*!< DMAMUX multiplexer input 4 */
    EVENT_INTERCONNECT_DMAMUX_5                          = ((uint8_t)0x6DU),                /*!< DMAMUX multiplexer input 5 */
    EVENT_INTERCONNECT_DMAMUX_6                          = ((uint8_t)0x70U),                /*!< DMAMUX multiplexer input 6 */
    EVENT_INTERCONNECT_DMAMUX_7                          = ((uint8_t)0x71U),                /*!< DMAMUX multiplexer input 7 */
    EVENT_INTERCONNECT_DMAMUX_8                          = ((uint8_t)0x74U),                /*!< DMAMUX multiplexer input 8 */
    EVENT_INTERCONNECT_DMAMUX_9                          = ((uint8_t)0x75U),                /*!< DMAMUX multiplexer input 9 */
    EVENT_INTERCONNECT_DMAMUX_10                         = ((uint8_t)0x78U),                /*!< DMAMUX multiplexer input 10 */
    EVENT_INTERCONNECT_DMAMUX_11                         = ((uint8_t)0x79U),                /*!< DMAMUX multiplexer input 11 */
} evic_periph_enum;

