burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_evic.h
/* slave mode selection */
#define EVIC_COUNTER_ENABLE                              (0x00U)                            /*!< Counter is enabled */
#define EVIC_COUNTER_RESTART                             (0x01U)                            /*!< Counter is restarted */
#define EVIC_EVENT_COUNT                                 (0x02U)                            /*!< Event count */
#define EVIC_EVENT_TRIGGER_DISABLE                       (0x03U)                            /*!< Event trigger is disabled */

/* single I/O mode */
#define SGIOM(regval)                                    (BITS(5,6) & ((uint32_t)(regval) << 5))
#define EVIC_SGIO_DETECTION_RISING                       SGIOM(0)                           /*!< Generate event when single I/O input rising edge */
#define EVIC_SGIO_DETECTION_FALLING                      SGIOM(1)                           /*!< Generate event when single I/O input falling edge */
#define EVIC_SGIO_DETECTION_BOTH_EDGE                    SGIOM(2)                           /*!< Generate event when single I/O input both edges */
#define EVIC_SGIO_OUTPUT_LOW                             SGIOM(0)                           /*!< single I/O output low level when event comes */
#define EVIC_SGIO_OUTPUT_HIGH                            SGIOM(1)                           /*!< single I/O output high level when event comes */
#define EVIC_SGIO_OUTPUT_INVERTED                        SGIOM(2)                           /*!< single I/O output inverted level when event comes */

/* single I/O pin */
#define SGIOPIN(regval)                                 (BITS(2,4) & ((uint32_t)(regval) << 2))
#define EVIC_SGIO_PIN_8                                 SGIOPIN(0)                          /*!< single I/O pin 8 is selected */
#define EVIC_SGIO_PIN_9                                 SGIOPIN(1)                          /*!< single I/O pin 9 is selected */
#define EVIC_SGIO_PIN_10                                SGIOPIN(2)                          /*!< single I/O pin 10 is selected */
#define EVIC_SGIO_PIN_11                                SGIOPIN(3)                          /*!< single I/O pin 11 is selected */
#define EVIC_SGIO_PIN_12                                SGIOPIN(4)                          /*!< single I/O pin 12 is selected */
#define EVIC_SGIO_PIN_13                                SGIOPIN(5)                          /*!< single I/O pin 13 is selected */
#define EVIC_SGIO_PIN_14                                SGIOPIN(6)                          /*!< single I/O pin 14 is selected */

/* single I/O port */
#define EVIC_SGIO_PORT_E                                (0x00U)                             /*!< single I/O port E is selected */
#define EVIC_SGIO_PORT_F                                (0x01U)                             /*!< single I/O port F is selected */

/* group I/O pin */
#define EVIC_GRPIO_PIN_8                                 EVIC_GRPFCFG_PF8SEL                /*!< group I/O pin 8 is selected */
#define EVIC_GRPIO_PIN_9                                 EVIC_GRPFCFG_PF9SEL                /*!< group I/O pin 9 is selected */
#define EVIC_GRPIO_PIN_10                                EVIC_GRPFCFG_PF10SEL               /*!< group I/O pin 10 is selected */
#define EVIC_GRPIO_PIN_11                                EVIC_GRPFCFG_PF11SEL               /*!< group I/O pin 11 is selected */
#define EVIC_GRPIO_PIN_12                                EVIC_GRPFCFG_PF12SEL               /*!< group I/O pin 12 is selected */
#define EVIC_GRPIO_PIN_13                                EVIC_GRPFCFG_PF13SEL               /*!< group I/O pin 13 is selected */
#define EVIC_GRPIO_PIN_14                                EVIC_GRPFCFG_PF14SEL               /*!< group I/O pin 14 is selected */

/* group I/O port */
#define EVIC_GRPIO_PORT_E                                (0x00U)                            /*!< group I/O port E is selected */
#define EVIC_GRPIO_PORT_F                                (0x01U)                            /*!< group I/O port F is selected */

/* group I/O output select */
#define GRPxOSEL(regval)                                (BITS(2,4) & ((uint32_t)(regval) << 2))
#define EVIC_GRPIO_OUTPUT_LOW                           GRPxOSEL(0)                         /*!< group I/O output low level when event comes */
#define EVIC_GRPIO_OUTPUT_HIGH                          GRPxOSEL(1)                         /*!< group I/O output high level when event comes */
#define EVIC_GRPIO_OUTPUT_INVERTED                      GRPxOSEL(2)                         /*!< group I/O output inverted level when event comes */
#define EVIC_GRPIO_OUTPUT_DATA                          GRPxOSEL(3)                         /*!< group I/O output holding data when event comes */
#define EVIC_GRPIO_OUTPUT_CIRCULAR_DATA                 GRPxOSEL(4)                         /*!< group I/O circularly shift output holding data when event comes */

/* group I/O input detection edge */
#define EVIC_GRPIO_DETECTION_RISING                      (0x00U)                            /*!< Generate event when group I/O input rising edge */
#define EVIC_GRPIO_DETECTION_FALLING                     (0x01U)                            /*!< Generate event when group I/O input falling edge */
#define EVIC_GRPIO_DETECTION_BOTH_EDGE                   (0x02U)                            /*!< Generate event when group I/O input both edges */

/* CPTIMERW and CPTIMER0 peripheral */
typedef enum {
    TARGET_CPTIMERW = 0,                                                                    /*!< CPTIMERW */
    TARGET_CPTIMER0                                                                         /*!< CPTIMER0 */
} evic_cptimer_enum;

/* Single I/O instance*/
typedef enum {
    SGIO0 = 0,                                                                              /*!< Single I/O 0 */
    SGIO1,                                                                                  /*!< Single I/O 1 */
    SGIO2,                                                                                  /*!< Single I/O 2 */
    SGIO3,                                                                                  /*!< Single I/O 3 */
} evic_single_io_enum;

/* function declarations */
/* set the event source for target peripheral */
void evic_init(evic_periph_enum target_periph, event_source_enum event_source);
/* get the trigger input signal for target peripheral */
event_source_enum evic_event_source_get(evic_periph_enum target_periph);
/* lock the event interconnect register */
void evic_register_lock_set(evic_periph_enum target_periph);
/* get the event interconnect register lock status */
FlagStatus evic_register_lock_get(evic_periph_enum target_periph);

/* select CPTIMERW or CPTIMER0 slave mode */
void evic_cptimer_slave_mode_select(evic_cptimer_enum cptimer_periph, uint32_t slavemode);

/* configure evic group member */
void evic_group_member_config(uint32_t group_pin, uint32_t group_port, ControlStatus newvalue);
/* configure evic group input detection edge */
void evic_group_edge_detection_config(uint32_t group_edge, uint32_t group_port);
/* configure evic group output level */
void evic_group_output_level_config(uint32_t group_level, uint32_t group_port);
/* enable evic group overwrite function */
void evic_group_overwrite_enable(uint32_t group_port);
/* disable evic group overwrite function */
void evic_group_overwrite_disable(uint32_t group_port);

/* set group holding data value */
void evic_data_set(uint8_t data, uint32_t group_port);
/* get group holding data value */
uint8_t evic_data_get(uint32_t group_port);

/* configure evic single I/O */
void evic_single_io_config(uint32_t single_pin, uint32_t single_port, evic_single_io_enum single_io);
/* configure evic single I/O input detection edge */
void evic_single_io_edge_detection_config(uint32_t single_edge, evic_single_io_enum single_io);
/* configure evic single I/O output level */
void evic_single_io_output_level_config(uint32_t single_level, evic_single_io_enum single_io);

/* enable software event register write */
void evic_register_write_enable(void);
/* disable software event register write */
void evic_register_write_disable(void);
/* get software event register write enable status */
FlagStatus evic_register_write_enable_get(void);
/* enable software event generation bit write */
void evic_bit_write_enable(void);
/* disable software event generation bit write */
void evic_bit_write_disable(void);
/* get software event generation bit write enable status */
FlagStatus evic_bit_write_enable_get(void);
/* evic software event generation */
void evic_software_event_generation(void);

#endif /* GD32M53X_EVIC_H */
